app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'R', 'PG-13') ORDER BY release_date ASC
---
  def index
    @all_ratings = Movie.ratings.sort # Get all distinct ratings in the table
    session[:sort_by] ||= 'title' # set sorting to titile if there isnt already a sort_by
    session[:ratings] ||= @all_ratings # session ratings hash
    session[:sort_by] = (params[:sort].blank? ? session[:sort_by] : params[:sort]) # if sort_param is blank, sort by previous, else by param
    session[:ratings] = (params[:ratings].blank? ? session[:ratings] : params[:ratings].keys) # if filter is blank, filter by previous, else by param
    @movies = Movie.where(:rating => session[:ratings]).order("#{session[:sort_by]} ASC") # sql query for given rating and ordered by sort_by